Season2/day05/Readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Readme</title>
<!-- 2017-08-17 周四 16:50 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">Readme</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Spacemacs Rocks Season 2 (Day 5)</a>
<ul>
<li><a href="#sec-1-1">1.1. Fix smartparen quote issue</a></li>
<li><a href="#sec-1-2">1.2. Editing large web page</a></li>
<li><a href="#sec-1-3">1.3. Add more useful packages for web development</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. web-mode</a></li>
<li><a href="#sec-1-3-2">1.3.2. js2-refactor</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. occur and imenu</a></li>
<li><a href="#sec-1-5">1.5. expand-region and iedit mode</a></li>
<li><a href="#sec-1-6">1.6. Bonus Time. Org export</a></li>
<li><a href="#sec-1-7">1.7. Exercises</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Spacemacs Rocks Season 2 (Day 5)</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Fix smartparen quote issue</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(define-advice show-paren-function (:around (fn) fix-show-paren-function)
  "Highlight enclosing parens."
  (cond ((looking-at-p "\\s(") (funcall fn))
	(t (save-excursion
	     (ignore-errors (backward-up-list))
	     (funcall fn)))))

  (sp-local-pair 'emacs-lisp-mode "'" nil :actions nil)
</pre>
</div>
<p>
注：相当于扩展show-paren-function，此advice名为fix-show-paren-function
    save-excursion 保存光标位置。
&#x2013;8'30"n
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Editing large web page</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun remove-dos-eol ()
  "Replace DOS eolns CR LF with Unix eolns CR"
  (interactive)
  (goto-char (point-min))
  (while (search-forward "\r" nil t) (replace-match "")))

(defun hidden-dos-eol ()
  "Do not show ^M in files containing mixed UNIX and DOS line endings."
  (interactive)
  (setq buffer-display-table (make-display-table))
  (aset buffer-display-table ?\^M []))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Add more useful packages for web development</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> web-mode</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
toggle indent in web-mode
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun my-web-mode-indent-setup ()
  (setq web-mode-markup-indent-offset 2) ; web-mode, html tag in html file
  (setq web-mode-css-indent-offset 2)    ; web-mode, css in html file
  (setq web-mode-code-indent-offset 2)   ; web-mode, js code in html file
  )

(add-hook 'web-mode-hook 'my-web-mode-indent-setup)

(defun my-toggle-web-indent ()
  (interactive)
  ;; web development
  (if (or (eq major-mode 'js-mode) (eq major-mode 'js2-mode))
      (progn
	(setq js-indent-level (if (= js-indent-level 2) 4 2))
	(setq js2-basic-offset (if (= js2-basic-offset 2) 4 2))))

  (if (eq major-mode 'web-mode)
      (progn (setq web-mode-markup-indent-offset (if (= web-mode-markup-indent-offset 2) 4 2))
	     (setq web-mode-css-indent-offset (if (= web-mode-css-indent-offset 2) 4 2))
	     (setq web-mode-code-indent-offset (if (= web-mode-code-indent-offset 2) 4 2))))
  (if (eq major-mode 'css-mode)
      (setq css-indent-offset (if (= css-indent-offset 2) 4 2)))

  (setq indent-tabs-mode nil))

(global-set-key (kbd "C-c t i") 'my-toggle-web-indent)
</pre>
</div>
<p>
;; C-c t i 用来4，2缩进切换
;; M-; 注释行（可以是范围）
</p>
</div>
</div>

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> js2-refactor</h4>
<div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'js2-mode-hook 'js2-refactor-mode)
(js2r-add-keybindings-with-prefix "C-c C-m")
</pre>
</div>
<ul class="org-ul">
<li>extract method (em)
</li>
<li>extract function (ef)
</li>
</ul>
<p>
选中代码块
C-c C-m :ef 然后输入新函数名，会将代码块提取为新的函数，原位置为新函数调用。
em 提取方法
</p>

<ul class="org-ul">
<li>extract slurp (sl)
</li>
</ul>
<p>
C-c C-m :sl 将for 代码块外部变量传入for代码块里面。
反向操作为 :ba
</p>

<ul class="org-ul">
<li>ip
</li>
</ul>
<p>
将本地函数数据值变为变量
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> occur and imenu</h3>
<div class="outline-text-3" id="text-1-4">
<p>
&#x2013;37'
注：有些windows中没有的键，暂时用C-c代替
</p>
<ol class="org-ol">
<li>improve occur
</li>
</ol>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun occur-dwim ()
  "Call `occur' with a sane default."
  (interactive)
  (push (if (region-active-p)
	    (buffer-substring-no-properties
	     (region-beginning)
	     (region-end))
	  (let ((sym (thing-at-point 'symbol)))
	    (when (stringp sym)
	      (regexp-quote sym))))
	regexp-history)
  (call-interactively 'occur))
(global-set-key "C-c s o" 'occur-dwim)
</pre>
</div>
<p>
&#x2013;43'
;;让弹出窗口显示在右边
M-x customize-group popwin position:right
</p>

<p>
;;查找替换
C-c s o &#x2013;&gt; C-x o &#x2013;&gt; M-x occur-edit-mode e 对查找结果进行编辑
</p>

<p>
;;光标所在位置的单词默认为C-c s o 初始要查找的内容
</p>

<ol class="org-ol">
<li>improve imenu
</li>
</ol>
<p>
M-x imenu 列出buffer中所有函数。输入函数名，可跳转到函数定义处。
</p>

<p>
M-x counsel-imenu 可以列出.js中的函数。(可以在init-packages中定义快捷键)
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun js2-imenu-make-index ()
      (interactive)
      (save-excursion
	;; (setq imenu-generic-expression '((nil "describe\\(\"\\(.+\\)\"" 1)))
	(imenu--generic-function '(("describe" "\\s-*describe\\s-*(\\s-*[\"']\\(.+\\)[\"']\\s-*,.*" 1)
				   ("it" "\\s-*it\\s-*(\\s-*[\"']\\(.+\\)[\"']\\s-*,.*" 1)
				   ("test" "\\s-*test\\s-*(\\s-*[\"']\\(.+\\)[\"']\\s-*,.*" 1)
				   ("before" "\\s-*before\\s-*(\\s-*[\"']\\(.+\\)[\"']\\s-*,.*" 1)
				   ("after" "\\s-*after\\s-*(\\s-*[\"']\\(.+\\)[\"']\\s-*,.*" 1)
				   ("Function" "function[ \t]+\\([a-zA-Z0-9_$.]+\\)[ \t]*(" 1)
				   ("Function" "^[ \t]*\\([a-zA-Z0-9_$.]+\\)[ \t]*=[ \t]*function[ \t]*(" 1)
				   ("Function" "^var[ \t]*\\([a-zA-Z0-9_$.]+\\)[ \t]*=[ \t]*function[ \t]*(" 1)
				   ("Function" "^[ \t]*\\([a-zA-Z0-9_$.]+\\)[ \t]*()[ \t]*{" 1)
				   ("Function" "^[ \t]*\\([a-zA-Z0-9_$.]+\\)[ \t]*:[ \t]*function[ \t]*(" 1)
				   ("Task" "[. \t]task([ \t]*['\"]\\([^'\"]+\\)" 1)))))
(add-hook 'js2-mode-hook
	      (lambda ()
		(setq imenu-create-index-function 'js2-imenu-make-index)))

(global-set-key (kbd "C-c s i") 'counsel-imenu)
</pre>
</div>
<p>
;; 将describe 等开头的语句块像函数一样定位。(测试时，先将js文件关闭再打开，然后C-c s i)
</p>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> expand-region and iedit mode</h3>
<div class="outline-text-3" id="text-1-5">
<p>
一般选中操作是，在一点按C-spac (windows C-s-@)，C-f/M-f向后选中，打”或(可以将内容括起。
expand-region 到init-packages; 
(global-set-key (kbd "C-=") 'er/expand-region)
作用：不再需要C-spac ，只要按C-=选中光标处字块，再按=向外扩展，-号收缩。
&#x2013;56'
</p>

<p>
iedit 加到init-packages
(global-set-key (kbd "C-c s e") 'iedit-mode) ;; def: C-;
注：可以配合前面的occur,exp-region使用
</p>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Bonus Time. Org export</h3>
<div class="outline-text-3" id="text-1-6">
<p>
export to html,  you could also export to pdf
</p>

<p>
<code>C-c C-e</code>
</p>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Exercises</h3>
<div class="outline-text-3" id="text-1-7">
<ol class="org-ol">
<li>Learn how to use emmet-mode to do zen coding: <a href="https://github.com/smihica/emmet-mode">https://github.com/smihica/emmet-mode</a>
</li>
<li>configure your system to export org file to pdf file
</li>
<li>install multiple cursor mode and compare it with iedit mode
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-08-17 周四 16:50</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.0.92.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
